#+TITLE: Microservicio Login - API
#+AUTHOR: fran
#+LANGUAGE: es
#+STARTUP: content indent showeverything
#+DESCRIPTION: API del microservicio Login
#+OPTIONS: results:t
* Descripción
Especificación de la API y respuestas.

* API :verb:
template http://localhost:4567
Accept: application/json
** Usuarios
*** Alta
Crea un nuevo usuario en la bd.
#+begin_src verb :exports both
  post /registrar
  Content-Type: application/json; charset=utf-8
  
  {
  "usuario": "UsuarioAPI",
  "email": "test123@gmail.com",
  "nombre": "UsuarioAPI",
  "contra": "secreto1234"
  }
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:44:42 GMT
Content-Length: 38

{
  "msj": "Alta exitosa",
  "res": {
    "id": 4
  }
}
#+end_example

*** Login
:properties:
:Verb-Store: res-login
:end:
#+begin_src verb :exports both
  post /login
  Content-Type: application/json; charset=utf-8

  {
  "usuario": "fran",
  "contra": "123"
  }
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:44:44 GMT
Content-Length: 962

{
  "msj": "Peticion exitosa",
  "res": {
    "id": 1,
    "usuario": "fran",
    "email": "fran1@gmail.com",
    "nombre": null,
    "telefono": null,
    "direccion": null,
    "roles": [
      {
        "id": 1,
        "nombre": "ADMIN",
        "permisos": [
          {
            "id": 1,
            "nombre": "USUARIO_ALTA"
          },
          {
            "id": 2,
            "nombre": "USUARIO_BAJA"
          },
          {
            "id": 3,
            "nombre": "USUARIO_LISTAR"
          },
          {
            "id": 4,
            "nombre": "USUARIO_MODIFICAR"
          }
        ]
      }
    ],
    "refresh_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE3NTczMTM4ODQsInRpcG8iOiJyZWZyZXNoIiwidXN1YXJpbyI6MX0.Z5pjTtFNGr2D3mn-6uKS9rnPQogiF0C2sby3O62Mq3M",
    "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE3NTY3MDk5ODQsInJvbGVzIjoiW3tcImlkXCI6IDEsIFwibm9tYnJlXCI6IFwiQURNSU5cIiwgXCJwZXJtaXNvc1wiOiBbe1wiaWRcIjogMSwgXCJub21icmVcIjogXCJVU1VBUklPX0FMVEFcIn0se1wiaWRcIjogMiwgXCJub21icmVcIjogXCJVU1VBUklPX0JBSkFcIn0se1wiaWRcIjogMywgXCJub21icmVcIjogXCJVU1VBUklPX0xJU1RBUlwifSx7XCJpZFwiOiA0LCBcIm5vbWJyZVwiOiBcIlVTVUFSSU9fTU9ESUZJQ0FSXCJ9XX1dIiwidGlwbyI6ImFjY2VzcyIsInVzdWFyaW8iOjF9.OtBGRK-fsNKGHn3WXl2dTAQaYRmHOXgE6n55ZsIgFHQ"
  }
}
#+end_example

*** Refresh
Refresca la sesión
#+begin_src verb :exports both
  get /r
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "refresh_token")}}
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:31:49 GMT
Content-Length: 968

{
  "msj": "Actualización exitosa",
  "res": {
    "id": 1,
    "usuario": "fran",
    "email": "fran1@gmail.com",
    "nombre": null,
    "telefono": null,
    "direccion": null,
    "roles": [
      {
        "id": 1,
        "nombre": "ADMIN",
        "permisos": [
          {
            "id": 1,
            "nombre": "USUARIO_ALTA"
          },
          {
            "id": 2,
            "nombre": "USUARIO_BAJA"
          },
          {
            "id": 3,
            "nombre": "USUARIO_LISTAR"
          },
          {
            "id": 4,
            "nombre": "USUARIO_MODIFICAR"
          }
        ]
      }
    ],
    "refresh_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE3NTczMTMxMDQsInRpcG8iOiJyZWZyZXNoIiwidXN1YXJpbyI6MX0.h7yH4lCxSr6A1eaEJdha98jTm7CRcOHKnmeeZpd7WW4",
    "access_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE3NTY3MDkyMDksInJvbGVzIjoiW3tcImlkXCI6IDEsIFwibm9tYnJlXCI6IFwiQURNSU5cIiwgXCJwZXJtaXNvc1wiOiBbe1wiaWRcIjogMSwgXCJub21icmVcIjogXCJVU1VBUklPX0FMVEFcIn0se1wiaWRcIjogMiwgXCJub21icmVcIjogXCJVU1VBUklPX0JBSkFcIn0se1wiaWRcIjogMywgXCJub21icmVcIjogXCJVU1VBUklPX0xJU1RBUlwifSx7XCJpZFwiOiA0LCBcIm5vbWJyZVwiOiBcIlVTVUFSSU9fTU9ESUZJQ0FSXCJ9XX1dIiwidGlwbyI6ImFjY2VzcyIsInVzdWFyaW8iOjF9.0iI-BswVakVSYgPaNeznjhBIjq_fXkNFSi4Ji_LBBOM"
  }
}
#+end_example

*** Alta Rol
Asigna el rol especificado al usuario especificado en la ruta
#+begin_src verb :exports both
  post /p/usuario/4/rol
  Content-Type: application/json; charset=utf-8
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}

  {
  "rol_id": 2
  }
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Content-Type: application/json
: Date: Mon, 01 Sep 2025 06:31:57 GMT
: Content-Length: 33
: 
: {
:   "msj": "Actualización exitosa"
: }
*** Buscar
#+begin_src verb :exports both
  get /p/usuario/4
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:32:02 GMT
Content-Length: 237

{
  "datos": {
    "id": 4,
    "usuario": "UsuarioAPI",
    "email": "test123@gmail.com",
    "nombre": "UsuarioAPI",
    "telefono": null,
    "direccion": null,
    "roles": [
      {
        "id": 2,
        "nombre": "EMPLEADO",
        "permisos": [
          {
            "id": 3,
            "nombre": "USUARIO_LISTAR"
          }
        ]
      }
    ]
  },
  "msj": "Peticion exitosa"
}
#+end_example

*** Baja Rol
#+begin_src verb :exports both
  delete /p/usuario/4/rol
  Content-Type: application/json; charset=utf-8
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}

  {
  "rol_id": 2
  }
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Content-Type: application/json
: Date: Mon, 01 Sep 2025 06:32:06 GMT
: Content-Length: 23
: 
: {
:   "msj": "Baja exitosa"
: }

*** Paginado
#+begin_src verb :exports both
  get /p/usuario
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:32:13 GMT
Content-Length: 791

{
  "msj": "Peticion exitosa",
  "res": [
    {
      "id": 1,
      "usuario": "fran",
      "email": "fran1@gmail.com",
      "nombre": null,
      "telefono": null,
      "direccion": null,
      "roles": [
        {
          "id": 1,
          "nombre": "ADMIN",
          "permisos": [
            {
              "id": 1,
              "nombre": "USUARIO_ALTA"
            },
            {
              "id": 2,
              "nombre": "USUARIO_BAJA"
            },
            {
              "id": 3,
              "nombre": "USUARIO_LISTAR"
            },
            {
              "id": 4,
              "nombre": "USUARIO_MODIFICAR"
            }
          ]
        }
      ]
    },
    {
      "id": 2,
      "usuario": "fran2",
      "email": "fran2@gmail.com",
      "nombre": null,
      "telefono": null,
      "direccion": null,
      "roles": [
        {
          "id": 2,
          "nombre": "EMPLEADO",
          "permisos": [
            {
              "id": 3,
              "nombre": "USUARIO_LISTAR"
            }
          ]
        }
      ]
    },
    {
      "id": 3,
      "usuario": "fran3",
      "email": "fran3@gmail.com",
      "nombre": null,
      "telefono": null,
      "direccion": null,
      "roles": [
        {
          "id": 3,
          "nombre": "USUARIO",
          "permisos": null
        }
      ]
    },
    {
      "id": 4,
      "usuario": "UsuarioAPI",
      "email": "test123@gmail.com",
      "nombre": "UsuarioAPI",
      "telefono": null,
      "direccion": null,
      "roles": null
    }
  ]
}
#+end_example

Paginado args
#+begin_src verb :exports both
  get /p/usuario?diferencia=0&limite=2
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}  
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:32:19 GMT
Content-Length: 509

{
  "msj": "Peticion exitosa",
  "res": [
    {
      "id": 1,
      "usuario": "fran",
      "email": "fran1@gmail.com",
      "nombre": null,
      "telefono": null,
      "direccion": null,
      "roles": [
        {
          "id": 1,
          "nombre": "ADMIN",
          "permisos": [
            {
              "id": 1,
              "nombre": "USUARIO_ALTA"
            },
            {
              "id": 2,
              "nombre": "USUARIO_BAJA"
            },
            {
              "id": 3,
              "nombre": "USUARIO_LISTAR"
            },
            {
              "id": 4,
              "nombre": "USUARIO_MODIFICAR"
            }
          ]
        }
      ]
    },
    {
      "id": 2,
      "usuario": "fran2",
      "email": "fran2@gmail.com",
      "nombre": null,
      "telefono": null,
      "direccion": null,
      "roles": [
        {
          "id": 2,
          "nombre": "EMPLEADO",
          "permisos": [
            {
              "id": 3,
              "nombre": "USUARIO_LISTAR"
            }
          ]
        }
      ]
    }
  ]
}
#+end_example

*** Modificar
#+begin_src verb :exports both
  put /p/usuario/4
  Content-Type: application/json; charset=utf-8
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}

  {
  "usuario": "Usuarioasd",
  "email": "testeomanwsadawseito@test.com",
  "nombre":"asdasdasd",
  "telefono":"266503231",
  "direccion":"Martin de Loyola 1524",
  "contra": "121231233"
  }
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Content-Type: application/json
: Date: Mon, 01 Sep 2025 06:32:26 GMT
: Content-Length: 33
: 
: {
:   "msj": "Actualización exitosa"
: }

*** Baja
#+begin_src verb :exports both
  delete /p/usuario/4
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Content-Type: application/json
: Date: Mon, 01 Sep 2025 06:40:32 GMT
: Content-Length: 23
: 
: {
:   "msj": "Baja exitosa"
: }

** Permisos
*** Alta
#+begin_src verb :exports both
  post /p/permiso
  Content-Type: application/json; charset=utf-8
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res""access_token")}}

  {
  "nombre": "PERMISO_DESDE_API"
  }
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:44:52 GMT
Content-Length: 48

{
  "msj": "Actualización exitosa",
  "res": {
    "id": 5
  }
}
#+end_example
*** Buscar
#+begin_src verb :exports both
  get /p/permiso/5
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:32:38 GMT
Content-Length: 71

{
  "msj": "Peticion exitosa",
  "res": {
    "id": 5,
    "nombre": "PERMISO_DESDE_API"
  }
}
#+end_example
*** Paginado
#+begin_src verb :exports both
  get /p/permiso
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:32:42 GMT
Content-Length: 212

{
  "msj": "Peticion exitosa",
  "res": [
    {
      "id": 1,
      "nombre": "USUARIO_ALTA"
    },
    {
      "id": 2,
      "nombre": "USUARIO_BAJA"
    },
    {
      "id": 3,
      "nombre": "USUARIO_LISTAR"
    },
    {
      "id": 4,
      "nombre": "USUARIO_MODIFICAR"
    },
    {
      "id": 5,
      "nombre": "PERMISO_DESDE_API"
    }
  ]
}
#+end_example
*** Baja
#+begin_src verb :exports both
  delete /p/permiso/4
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Content-Type: application/json
: Date: Mon, 01 Sep 2025 06:44:58 GMT
: Content-Length: 23
: 
: {
:   "msj": "Baja exitosa"
: }

** Rol
*** Alta
#+begin_src verb :exports both
  post /p/rol
  Content-Type: application/json; charset=utf-8
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}

  {
  "nombre": "ROL_DESDE_API"
  }
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:45:57 GMT
Content-Length: 48

{
  "msj": "Actualización exitosa",
  "res": {
    "id": 4
  }
}
#+end_example
*** Alta permiso
#+begin_src verb :exports both
  post /p/rol/4/5
  Content-Type: application/json; charset=utf-8
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Content-Type: application/json
: Date: Mon, 01 Sep 2025 06:46:06 GMT
: Content-Length: 33
: 
: {
:   "msj": "Actualización exitosa"
: }
*** Buscar
#+begin_src verb :exports both
  get /p/rol/4
  Content-Type: application/json; charset=utf-8
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:46:09 GMT
Content-Length: 118

{
  "msj": "Peticion exitosa",
  "res": {
    "id": 4,
    "nombre": "ROL_DESDE_API",
    "permisos": [
      {
        "id": 5,
        "nombre": "PERMISO_DESDE_API"
      }
    ]
  }
}
#+end_example

*** Baja Permiso
#+begin_src verb :exports both
  delete /p/rol/4/5
  Content-Type: application/json; charset=utf-8
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Content-Type: application/json
: Date: Mon, 01 Sep 2025 06:46:20 GMT
: Content-Length: 23
: 
: {
:   "msj": "Baja exitosa"
: }

*** Baja Rol
#+begin_src verb :exports both
  delete /p/rol/4
  Content-Type: application/json; charset=utf-8
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Content-Type: application/json
: Date: Mon, 01 Sep 2025 06:46:52 GMT
: Content-Length: 23
: 
: {
:   "msj": "Baja exitosa"
: }

*** Paginado

#+begin_src verb :exports both
  get /p/rol
  Authorization: Bearer {{(verb-json-get (oref (verb-stored-response "res-login") body) "res" "access_token")}}
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json
Date: Mon, 01 Sep 2025 06:46:55 GMT
Content-Length: 296

{
  "msj": "Peticion exitosa",
  "res": [
    {
      "id": 1,
      "nombre": "ADMIN",
      "permisos": [
        {
          "id": 1,
          "nombre": "USUARIO_ALTA"
        },
        {
          "id": 2,
          "nombre": "USUARIO_BAJA"
        },
        {
          "id": 3,
          "nombre": "USUARIO_LISTAR"
        }
      ]
    },
    {
      "id": 2,
      "nombre": "EMPLEADO",
      "permisos": [
        {
          "id": 3,
          "nombre": "USUARIO_LISTAR"
        }
      ]
    },
    {
      "id": 3,
      "nombre": "USUARIO",
      "permisos": null
    }
  ]
}
#+end_example
